## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
cloudwatch_alarms.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                    NAME                                    |
|----------|----------------------------------------------------------------------------|
| update   | `aws_cloudwatch_log_metric_filter.coredns-nxdomain-notification-filter[0]` |
|          | `aws_cloudwatch_metric_alarm.coredns-nxdomain-notification-warning[0]`     |
|          | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s`             |
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.coredns-nxdomain-notification-filter[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "coredns-nxdomain-notification-filter" {
        id             = "CoreDNSNXDOMAINNotificationFilter"
        name           = "CoreDNSNXDOMAINNotificationFilter"
      ~ pattern        = "{ $.log = \"*notification*\" && $.log = \"*NXDOMAIN*\" }" -> "{ $.log = \"*notification.canada.ca. *\" && $.log = \"*NXDOMAIN*\" }"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.coredns-nxdomain-notification-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "coredns-nxdomain-notification-warning" {
      ~ alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      ~ alarm_description                     = "More than 30 NXDOMAIN responses containing 'notification' in CoreDNS logs in 5 minutes" -> "More than 30 NXDOMAIN responses containing the basedomain in CoreDNS logs in 5 minutes"
        id                                    = "coredns-nxdomain-notification-warning"
      ~ ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                                  = {}
        # (19 unchanged attributes hidden)
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                     = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
      ~ release_version        = "1.33.0-20250519" -> "1.33.0-20250627"
        tags                   = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn                  = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n|terraform-20250610153711956300000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20250610153711956300000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
